In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), columns=list('ABCD'))

In [9]:
print(df)

          A         B         C         D
0 -0.585303 -1.094834 -1.195361  0.281092
1 -0.867207  0.923327  1.222956 -0.245008
2  0.170921  0.459677  0.694573  1.015295
3  1.190277  1.021415 -0.449876 -0.089617
4  0.696572 -0.292261 -0.384502 -2.228936
5 -1.192083 -1.003900 -0.138495  0.179534

In [8]:
df

          A         B         C         D
0 -0.585303 -1.094834 -1.195361  0.281092
1 -0.867207  0.923327  1.222956 -0.245008
2  0.170921  0.459677  0.694573  1.015295
3  1.190277  1.021415 -0.449876 -0.089617
4  0.696572 -0.292261 -0.384502 -2.228936
5 -1.192083 -1.003900 -0.138495  0.179534

In [7]:
df.drop(['A'], axis=1)

          B         C         D
0 -1.094834 -1.195361  0.281092
1  0.923327  1.222956 -0.245008
2  0.459677  0.694573  1.015295
3  1.021415 -0.449876 -0.089617
4 -0.292261 -0.384502 -2.228936
5 -1.003900 -0.138495  0.179534

In [12]:
newdf = df.drop(['B'], axis=1)

In [13]:
newdf

          A         C         D
0 -0.585303 -1.195361  0.281092
1 -0.867207  1.222956 -0.245008
2  0.170921  0.694573  1.015295
3  1.190277 -0.449876 -0.089617
4  0.696572 -0.384502 -2.228936
5 -1.192083 -0.138495  0.179534

In [14]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [15]:
df.drop(['A'], axis=1, inplace=True)
df.columns

Index(['B', 'C', 'D'], dtype='object')

In [16]:
df

          B         C         D
0 -1.094834 -1.195361  0.281092
1  0.923327  1.222956 -0.245008
2  0.459677  0.694573  1.015295
3  1.021415 -0.449876 -0.089617
4 -0.292261 -0.384502 -2.228936
5 -1.003900 -0.138495  0.179534

In [17]:
df = pd.DataFrame(np.random.randn(6, 4), columns=list('ABCD'))

In [18]:
df

          A         B         C         D
0  0.684535 -0.090392  0.510227  1.383530
1 -0.870035  0.124939  3.683882 -0.291947
2 -0.148495 -1.845468  1.586908 -0.348919
3 -0.993745 -0.526075 -0.359410  0.229626
4  0.752993  0.426129  0.552428  0.360405
5 -1.053998 -1.369394 -1.435013  0.706749

In [19]:
df2 = df.drop(['B','C'], axis=1)
df2

          A         D
0  0.684535  1.383530
1 -0.870035 -0.291947
2 -0.148495 -0.348919
3 -0.993745  0.229626
4  0.752993  0.360405
5 -1.053998  0.706749

In [21]:
cols = ['B','C']
df2 = df.drop(cols, axis=1)
df2

          A         D
0  0.684535  1.383530
1 -0.870035 -0.291947
2 -0.148495 -0.348919
3 -0.993745  0.229626
4  0.752993  0.360405
5 -1.053998  0.706749

In [30]:
df['A']

0    0.684535
1   -0.870035
2   -0.148495
3   -0.993745
4    0.752993
5   -1.053998
Name: A, dtype: float64

In [31]:
df[['A','B']]

          A         B
0  0.684535 -0.090392
1 -0.870035  0.124939
2 -0.148495 -1.845468
3 -0.993745 -0.526075
4  0.752993  0.426129
5 -1.053998 -1.369394

In [32]:
df.drop(df.columns[0], axis =1)

          B         C         D
0 -0.090392  0.510227  1.383530
1  0.124939  3.683882 -0.291947
2 -1.845468  1.586908 -0.348919
3 -0.526075 -0.359410  0.229626
4  0.426129  0.552428  0.360405
5 -1.369394 -1.435013  0.706749

In [33]:
df = pd.DataFrame({"X1":range(1,6),"X_2":range(2,7),"YX":range(3,8),"Y_1":range(2,7),"Z":range(5,10)})

In [34]:
df

   X1  X_2  YX  Y_1  Z
0   1    2   3    2  5
1   2    3   4    3  6
2   3    4   5    4  7
3   4    5   6    5  8
4   5    6   7    6  9

In [35]:
df.loc[:,~df.columns.str.contains('^X')]

   YX  Y_1  Z
0   3    2  5
1   4    3  6
2   5    4  7
3   6    5  8
4   7    6  9

In [37]:
df.drop(df.columns[df.columns.str.contains('^Y')], axis=1)

   X1  X_2  Z
0   1    2  5
1   2    3  6
2   3    4  7
3   4    5  8
4   5    6  9